[View in Colaboratory](https://colab.research.google.com/github/ArjunGajmer/Assignment-ML/blob/master/Assignment9.ipynb)

##Titanic Survival Prediction
We will use the Logisctic Regression to predict the survival of passenger during the titanic ship shrinking.We will use the data set from [train](https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/train.csv ) to train our model and use [test](https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/test.csv) to predict the survuval of the passenger.

### Importing Libraries

In [0]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LogisticRegression
from sklearn.cross_validation import train_test_split

### Train Dateset

In [387]:
df_train=pd.read_csv('https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/train.csv ')
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [388]:
print('Shape:')
df_train.shape

Shape:

(891, 12)

In [389]:
print('Size:')
df_train.size

Size:

10692

In [390]:
print('Null Check:')
df_train.isnull().sum()

Null Check:

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Test Dataset

In [391]:
df_test=pd.read_csv('https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/test.csv')
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [392]:
print('Shape:')
df_test.shape

Shape:

(418, 11)

In [393]:
print('Size:')
df_test.size

Size:

4598

In [394]:
print('Null Check:')
df_test.isnull().sum()

Null Check:

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

#### Concatination of two dataset

In [395]:
df=pd.concat([df_train,df_test])
df.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [396]:
print('Shape:')
df.shape

Shape:

(1309, 12)

In [397]:
print('Size:')
df.size

Size:

15708

In [398]:
print('Null Check:')
df.isnull().sum()

Null Check:

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

In [399]:
print('Removing NaN values from the column ‘Survived’. :')
df=df.dropna(subset=['Survived'])
df.isnull().sum()

Removing NaN values from the column ‘Survived’. :

Age            177
Cabin          687
Embarked         2
Fare             0
Name             0
Parch            0
PassengerId      0
Pclass           0
Sex              0
SibSp            0
Survived         0
Ticket           0
dtype: int64

In [400]:
print('Shape:')
df.shape

Shape:

(891, 12)

In [401]:
print('Size:')

df.size

Size:

10692


Creating a new column 'Has_Cabin' that tells you whether passengers had a cabin or not.

In [402]:
df['Has_cabin']=pd.Series([0 if value else 1 for value in df['Cabin'].isnull()])
df.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Has_cabin
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171,0
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599,1
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282,0
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803,1
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450,0

Filling NAN  value

In [0]:
df['Age']=df['Age'].fillna(df['Age'].mean())

In [0]:
df['Embarked']=df['Embarked'].fillna('S')

 Creating two new columns “Categorical_age” and “Categorical_fare”, where you will put people that are within a certain range of age or fare in the same bin. 
You can do this by using the pandas function qcut() to bin your numerical data. (This is done because there is a range of ages and fares, so there might be fluctuations in those numbers that don't reflect patterns in the data, which might be noise.)

In [0]:
df['Categorical_age']=pd.qcut(df.Age,4,labels=[1,2,3,4])

In [0]:
df['Categorical_fare']=pd.qcut(df.Fare,4,labels=[1,2,3,4])

Creating Sex_code as a numerical indicator whether a person is male or female.
for male ,1 is used and for female ,0 is used.

In [0]:
df['Sex_code']=pd.Series([1 if value =='male' else 0 for value in df.Sex])

Drop columns Cabin, Name, Passengerid, Ticket, Age, Fare, SibSp, Parch

In [0]:
df=df.drop(['Cabin', 'Name', 'Ticket', 'Age', 'Fare', 'SibSp', 'Parch','PassengerId','Sex'],axis=1)

Transform all variables of 'Embraked' into numeric ones using get_dummies()

In [409]:
em=pd.get_dummies(df['Embarked'],prefix='Embraked')
em.head()

   Embraked_C  Embraked_Q  Embraked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [0]:
df=df.drop('Embarked',axis=1)

In [411]:
df=pd.concat([df,em],axis=1)
df.head()

,Pclass,Survived,Has_cabin,Categorical_age,Categorical_fare,Sex_code,Embraked_C,Embraked_Q,Embraked_S
0,3,0.0,0,1,1,1,0,0,1
1,1,1.0,1,4,4,0,1,0,0
2,3,1.0,0,2,2,0,0,0,1
3,1,1.0,1,3,4,0,0,0,1
4,3,0.0,0,3,2,1,0,0,1

Creating labels and train dataframes.

In [0]:
labels=df['Survived']
train=df.drop(['Survived'],axis=1)

Splitting the dataset into training set and test set

In [0]:
x_train,x_test,y_train,y_test=train_test_split(train,labels,test_size=0.3,random_state=2)

### Building Logistic Regression model

In [0]:
model=LogisticRegression()

#### Training model

In [415]:
model.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

### Predicting

In [0]:

predict=model.predict(x_test)

In [417]:
predict

array([0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 1., 1., 0., 0., 1., 0.,
       0., 1., 0., 1., 1., 0., 1., 0., 1., 1., 0., 0., 0., 0., 0., 1., 0.,
       0., 1., 1., 0., 0., 0., 0., 0., 1., 0., 0., 0., 1., 0., 0., 1., 0.,
       0., 0., 0., 0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 1., 0., 1., 0.,
       0., 0., 1., 0., 1., 0., 1., 0., 0., 0., 1., 0., 1., 0., 0., 0., 1.,
       1., 0., 0., 1., 0., 0., 0., 0., 0., 0., 1., 1., 1., 0., 1., 1., 0.,
       1., 1., 0., 1., 1., 1., 0., 0., 0., 0., 0., 0., 1., 1., 0., 1., 0.,
       0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 1., 1., 0., 1.,
       0., 0., 0., 0., 1., 1., 1., 1., 0., 1., 0., 0., 0., 1., 0., 1., 0.,
       0., 1., 0., 0., 1., 1., 0., 1., 0., 0., 0., 1., 1., 0., 0., 1., 0.,
       0., 1., 1., 1., 0., 0., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 1.,
       0., 0., 0., 1., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 1., 0., 0.,
       1., 1., 0., 0., 0., 1., 1., 0., 0., 1., 0., 1., 1., 1., 0., 0., 0.,
       0., 1., 1., 0., 0., 1., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 1.,
       0., 1., 0., 0., 1., 1., 0., 0., 1., 1., 0., 1., 0., 0., 1., 0., 0.,
       0., 0., 0., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0.])

#### Accuracy Check

In [418]:
model.score(x_test,y_test)

0.7910447761194029